app/views/tasks/show.html.erb

  Tags:
  <% @task.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."task_id" = ?  [["task_id", 7]]