app/views/tags/show.html.erb

SELECT "tasks".* FROM "tasks" INNER JOIN "taggings" ON "tasks"."id" = "taggings"."task_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 6]]
---
<ul>
  <% @tag.tasks.each do |task| %>