app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", true], ["updated_at", 2017-01-05 09:28:42 UTC], ["id", 10]]
---
	def complete
		@task = Task.find(params[:id])
		@task.completed = true
		@task.save

INSERT INTO "tasks" ("title", "text", "created_at", "updated_at", "completed") VALUES (?, ?, ?, ?, ?)  [["title", "6/1"], ["text", "Go to Can Gio"], ["created_at", 2017-01-05 09:47:36 UTC], ["updated_at", 2017-01-05 09:47:36 UTC], ["completed", false]]
---
	def create
		@task = Task.new(task_params)

		respond_to do |format|
			if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Everyday at 6"], ["text", "Brush the teeth"], ["updated_at", 2017-01-02 02:36:26 UTC], ["id", 1]]
---
	def update
		@task = Task.find(params[:id])
		respond_to do |format|
			if @task.update(task_params)